v01dma1n/gustav_clock/src/gustav_clock/libraries/ESP32NTPClock_Drivers/src/ESP32NTPClock_MAX6921.h
#ifndef ESP32NTPCLOCK_MAX6921_H
#define ESP32NTPCLOCK_MAX6921_H

#include <ESP32NTPClock.h>
#include <SPI.h>

class DispDriverMAX6921 : public IDisplayDriver {
public:
    DispDriverMAX6921(int displaySize, int sclkPin, int misoPin, int mosiPin, int ssPin, int blankPin);

    // IDisplayDriver interface implementation
    void begin() override;
    int getDisplaySize() override;
    void setBrightness(uint8_t level) override;
    void clear() override;
    void setChar(int position, char character, bool dot = false) override;
    void setSegments(int position, uint16_t mask) override;
    void writeDisplay() override;
    bool needsContinuousUpdate() const override;

private:
    unsigned long mapAsciiToSegment(char ascii_char);
    void spiCmd(unsigned long data);

    int _displaySize;
    int _blankPin;
    int _ssPin;
    unsigned long* _displayBuffer; // Dynamically allocated buffer
    
    SPIClass* _spi;
    int _currentDigit;
    int _multiplexStep;
    unsigned long _lastMultiplexTime;    
};

#endif // ESP32NTPCLOCK_MAX6921_H
